//
//  MockText.swift
//  Reed
//
//  Created by Roger Luo on 9/9/20.
//  Copyright © 2020 Roger Luo. All rights reserved.
//

import Foundation

class MockReaderData {
    static let seriesTitle: [String] = [
        "婚約破棄を狙って記憶喪失のフリをしたら、素っ気ない態度だった婚約者が「記憶を失う前の君は、俺にベタ惚れだった」という、とんでもない嘘をつき始めた"
    ]
    
    static let authorName: [String] = [
        "琴子"
    ]
    
    static let chapterName: [String] = [
        "婚約者とわたし"
    ]
    
    static let content: [String] = [
        """
        「いい天気ですね」
        「ああ」

        　何か話題をと必死に考えた末に口から出てきたのは、そんなありふれた言葉で。いつも通り素っ気ない返事を返されてしまい、再び沈黙が流れる。

        　わたしは小さくため息をつくと、公爵邸の窓の外の景色から目の前に座る美しい男へと、視線を移した。

        　───フィリップ・ローレンソン。公爵家の嫡男である彼は、わたしの婚約者でもあった。

        　夜空のような濃紺の髪に、輝く星にも似た金色の瞳。その顔立ちは、誰もが目を見張るほどに整い過ぎている。寡黙でいつも無表情な彼は氷の貴公子と呼ばれており、その美しさから社交界でも絶大な人気を誇っていた。

        　そんな彼は、この気まずい空気が気にはならないらしく、涼しい顔で優雅にティーカップに口をつけている。

        　……子爵家の娘であるわたし、ヴィオラ・ウェズリーは何をとっても、間違いなく彼と釣り合わない。ひとつだけ良いところがあるとすれば、少し見目が良いことくらいだろう。けれどそれも彼の前では霞んでしまう。

        　何故そんなわたしと彼の婚約が成立したかというと、ローレンソン公爵家は昔、家の存続がかかった危機に瀕し、それを救ったのが占い師だった当時のウェズリー子爵令嬢だったという。彼女の言う通りにしたところ、全てがうまくいったんだとか。

        　礼をしたいという公爵に対し、子爵令嬢は「いつかお互いの家に、同い年の異性の子供が生まれたら、二人を結婚させて欲しい」とだけ頼んだらしい。そして百年以上が経ち、ようやく条件を満たしたのがわたしとフィリップ様だった。

        　ローレンソン公爵家は未だに我が家に対して恩義を感じているらしく、フィリップ様の一ヶ月後に誕生した生後数日のわたしに、婚約を申し込んできた。我が家としては断る理由もなく、あっという間にこの婚約は結ばれたのだ。

        「あの、フィリップ様」
        「何だ」
        「こうしてお会いするのは月に一度に戻すよう、フィリップ様からも公爵様へ言っていただけませんか？」

        　幼い頃から月に一度は必ず、こうして２人で過ごす時間が設けられているけれど、今ではただ向かい合ってお茶を飲み、ぽつりぽつりと言葉を交わすだけ。

        　基本わたしが何か話しかけて、彼が「ああ」とか「そうだな」と返して終わりなのだ。苦痛でしかない。

        　元々彼は口数は多くないけれど、わたしの前では余計に喋らなくなるのだ。それも、子供の頃から。毎度、早く時間が過ぎないかと祈るばかりだった。

        　けれど数ヶ月前から突然、それが月に二度になった。公爵様が何を考えているのかわからないけれど、お互いにとってこんなにも無駄な時間はないだろう。特にフィリップ様はお忙しい方だ。先日、一度に戻して頂けませんかとわたしから公爵様にお願いしたけれど、笑顔で流されてしまった。

        「何故だ？」

        　彼も同じ気持ちだと思っていたからこそ、そんな言葉が帰ってきたことで、わたしの口からは間の抜けた声が漏れる。

        「な、何故って……フィリップ様はお忙しいでしょうし、」
        「暇ではないが、数時間程度だ。支障はない」

        　そう言われてしまっては、「わかりました」というほかない。そしてまたしばらくの沈黙が続いた後、口を開いたのはフィリップ様だった。

        「来週、知人の夜会に招待されているんだ。君も一緒に参加してくれないだろうか」
        「わかりました」

        　婚約者として、彼と社交の場に出ることは多くない。どうしてもわたしも一緒に行かなければならない場合だけ、こうして彼から誘ってくる。

        　けれど参加したところで、彼はわたしが一緒だと最低限の挨拶を済ませた後、毎回すぐに帰ろうとするのだ。一人の時にはそうではないと、周りからも聞いている。そんなに人前でわたしといるのが恥ずかしいのだろうか。

        　わたしはわたしで、フィリップ様のファンの令嬢達から嫌味を言われたりするのが嫌で、一人では社交の場にほとんど出ないため、引きこもりのような生活になりかけていた。フィリップ様の助けになるよう、幼い頃から厳しい教育は受けてきたものの、わたしなんかに公爵夫人の荷は重すぎる。

        　本日何杯目かわからないお茶を飲み干すと、またしばらく続くであろう沈黙を前に、わたしは木で出来たテーブルの年輪の数を数え始めたのだった。



        ◇◇◇



        「今日はありがとうございました。では来週、夜会の時に」
        「ああ」

        　フィリップ様は用事があるらしく、あれから３０分ほどでお開きになった。彼はどんなに忙しくとも、必ず馬車までわたしをエスコートしてくれるのだ。

        　馬車に乗り込み窓から彼の姿が見えなくなると、わたしは深いため息を吐いた。

        「……はあ」

        　１８歳になったわたしと彼の結婚式まで、あと８ヶ月。このまま結婚したところで、お互い幸せになどなれないだろう。フィリップ様にはもっと相応しい相手がいるはずだ。

        　我が家も子爵家と言えど裕福で、彼との結婚がなくなったとしても困らない。

        『フィリップ様なんて、大嫌い！』
        『……俺も、嫌いだ』

        　ふと、そんな昔のやり取りを思い出す。確かあれは１２歳の頃だった。それまではフィリップ様はあまり会話はしてくれないものの、今ほど気まずくはなかった記憶がある。

        　一人馬車に揺られながら、どうにかして婚約を破棄する方法はないだろうかと、ぼんやり考えていた時だった。

        　突然、物凄い音と共に馬車が揺れ、次の瞬間には天地がひっくり返っていて。それと同時に頭に衝撃を感じ、そこでわたしの意識は途切れたのだった。
        """
    ]
}
